In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [18]:
data = pd.read_csv('sealing.csv')

In [19]:
data

      country  age  selary purchased
0  Bangladesh   44   70000       yes
1      France   24   44000        no
2     Germany   32   45000       yes
3  Bangladesh   30   50000        no
4      France   35   60000       yes
5     Germany   50   80000        no
6  Bangladesh   45   40000       yes
7      France   21   41000        no
8     Germany   20   30000       yea

In [20]:
x =data.iloc[:,1:3]

In [21]:
x

   age  selary
0   44   70000
1   24   44000
2   32   45000
3   30   50000
4   35   60000
5   50   80000
6   45   40000
7   21   41000
8   20   30000

In [22]:
from sklearn.preprocessing import MinMaxScaler

In [23]:
MMS=MinMaxScaler(feature_range=(0,1))

In [24]:
rank = MMS.fit_transform(x)

In [25]:
rank

array([[0.8       , 0.8       ],
       [0.13333333, 0.28      ],
       [0.4       , 0.3       ],
       [0.33333333, 0.4       ],
       [0.5       , 0.6       ],
       [1.        , 1.        ],
       [0.83333333, 0.2       ],
       [0.03333333, 0.22      ],
       [0.        , 0.        ]])

In [26]:
from sklearn.preprocessing import StandardScaler

In [27]:
SS = StandardScaler()

In [28]:
temp = SS.fit_transform(x)

In [29]:
temp

array([[ 1.021919  ,  1.25743222],
       [-0.91434858, -0.47338625],
       [-0.13984155, -0.40681631],
       [-0.33346831, -0.0739666 ],
       [ 0.15059859,  0.59173281],
       [ 1.60279928,  1.92313163],
       [ 1.11873238, -0.73966601],
       [-1.20478872, -0.67309607],
       [-1.3016021 , -1.40536542]])

In [ ]:
from sklearn.prepeocessing import MinMaxScaler